LowFareSearch.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <LowFareSearchReq xmlns="http://www.travelport.com/schema/air_v52_0" TargetBranch="P7212436">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v52_0" OriginApplication="UAPI" />
            <SearchAirLeg>
                <SearchOrigin>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v52_0" Code="DAC" PreferCity="true" />
                </SearchOrigin>
                <SearchDestination>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v52_0" Code="YYZ" PreferCity="true" />
                </SearchDestination>
                <SearchDepTime PreferredTime="2024-11-25" />
            </SearchAirLeg>
            <AirSearchModifiers>
                <PreferredProviders>
                    <Provider xmlns="http://www.travelport.com/schema/common_v52_0" Code="1G" />
                </PreferredProviders>
            </AirSearchModifiers>
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v52_0" Code="ADT" BookingTravelerRef="ADT_0" />
        </LowFareSearchReq>
    </s:Body>
</s:Envelope>